{
  "accepted": [
    {
      "by": "Shaman/Priest",
      "partners": [
        "Tribal Elder"
      ],
      "terms": {
        "tithe_support": "+5%"
      }
    },
    {
      "by": "Hunter-Gatherer Collective",
      "partners": [
        "Tribal Elder"
      ],
      "terms": {
        "food_contribution": "+15%",
        "land_access_guarantee": "maintained"
      }
    },
    {
      "by": "Farmer Family Unit",
      "partners": [
        "Tribal Elder"
      ],
      "terms": {
        "food_contribution": "+10%",
        "land_usage_rights": "guaranteed"
      }
    },
    {
      "by": "Craftsman",
      "partners": [
        "Tribal Elder"
      ],
      "terms": {
        "tool_provision": "+10%",
        "food_exchange_rate": "-5%"
      }
    },
    {
      "by": "Village Watch",
      "partners": [
        "Tribal Elder"
      ],
      "terms": {
        "community_support": "+manpower for patrols",
        "fortification_enhancement": "+timber",
        "manpower_allocation": "-2%"
      }
    },
    {
      "by": "Tribal Elder",
      "partners": [
        "Village Watch"
      ],
      "terms": {
        "community_support": "+manpower for patrols",
        "fortification_enhancement": "+timber",
        "manpower_allocation": "-2%"
      }
    }
  ],
  "coordinated_actions": [
    {
      "by": "Tribal Elder",
      "partners": [
        "Shaman/Priest"
      ],
      "action_name": "Increased Tithe Collection and Spiritual Support",
      "goal": "Enhance community religious devotion and cohesion by allocating more resources to spiritual functions.",
      "operational_plan": "The Tribal Elder will oversee an adjustment to tithe collection, resulting in a 5% increase. The Shaman/Priest will ensure these resources are used for community rituals and spiritual guidance, reinforcing religious influence.",
      "expected_effects": {
        "Economy.tithe_rate": "+0.05",
        "Society.religious_influence": "+0.05"
      },
      "risk_notes": "Potential for slight reduction in immediate secular resources due to increased tithe.",
      "justification": "The accepted proposal aims to strengthen societal cohesion and religious influence through increased tithe support."
    },
    {
      "by": "Farmer Family Unit",
      "partners": [
        "Tribal Elder"
      ],
      "action_name": "Increased Food Contribution and Land Use Assurance",
      "goal": "Maximize personal food stores and yield while contributing more to the community, secured by guaranteed land usage rights.",
      "operational_plan": "The Farmer Family Unit will increase its food contribution by 10% to the community. In return, the Tribal Elder guarantees their land usage rights, ensuring family survival and maximizing yield.",
      "expected_effects": {
        "Resources.food": "+10%",
        "Economy.rents_rate": "+0.01",
        "Society.inequality": "-0.01",
        "Resources.manpower": "-1%"
      },
      "risk_notes": "Increased labor demand on family units, potential minor increase in rents due to higher yields.",
      "justification": "The accepted terms align with the Farmer Family Unit's incentives to maximize yield and ensure survival, while contributing to community food security."
    },
    {
      "by": "Hunter-Gatherer Collective",
      "partners": [
        "Tribal Elder"
      ],
      "action_name": "Enhanced Food Contribution with Land Access Guarantee",
      "goal": "Maximize resource acquisition and contribute significantly to community food stores, with guaranteed access to foraging grounds.",
      "operational_plan": "The Hunter-Gatherer Collective will increase its food contribution by 15%. The Tribal Elder guarantees continued access to hunting and gathering lands, ensuring collective resource acquisition.",
      "expected_effects": {
        "Resources.food": "+15%",
        "Resources.manpower": "-4%",
        "Environment.harvest_quality": "+0.02"
      },
      "risk_notes": "Temporary reduction in available manpower for other community tasks; potential for over-exploitation of foraging grounds if not managed.",
      "justification": "The accepted agreement directly supports the Hunter-Gatherer Collective's incentive to maximize resource acquisition while contributing to community food stores."
    },
    {
      "by": "Craftsman",
      "partners": [
        "Tribal Elder"
      ],
      "action_name": "Increased Tool Production and Favorable Food Exchange",
      "goal": "Produce more essential tools and trade them for food at a better rate, thereby improving craft skills and acquiring necessities.",
      "operational_plan": "The Craftsman will increase tool provision by 10%. The Tribal Elder agrees to a 5% reduction in the food exchange rate for these tools, facilitating better trade for necessities.",
      "expected_effects": {
        "Economy.productivity": "+0.03",
        "Resources.food": "-3%",
        "Resources.timber": "-2%",
        "Economy.price_level": "+0.01"
      },
      "risk_notes": "Increased demand for timber; reduced food availability for other community needs due to the exchange rate.",
      "justification": "The accepted terms incentivize improved craft skills and better trade for necessities, aligning with the Craftsman's core incentives."
    },
    {
      "by": "Tribal Elder",
      "partners": [
        "Village Watch"
      ],
      "action_name": "Strengthened Community Security and Resource Allocation",
      "goal": "Enhance community safety through increased patrols and fortifications, supported by a slight reallocation of manpower and provision of timber.",
      "operational_plan": "The Tribal Elder agrees to provide manpower support for Village Watch patrols and allocate timber for fortification enhancement. This is balanced by a 2% reallocation of overall manpower.",
      "expected_effects": {
        "State.borders_threat": "-0.04",
        "Infrastructure.fortifications": "+0.03",
        "Resources.manpower": "-2%",
        "State.stability": "+0.02"
      },
      "risk_notes": "A slight reduction in available manpower for other community tasks; potential for increased resource strain due to fortification efforts.",
      "justification": "This action addresses the Village Watch's request to bolster security and aligns with the Tribal Elder's mandate to maintain community survival and harmony."
    }
  ]
}